OS-Q/simba/make/arduino/esp32/boards.txt
#
# @section License
#
# The MIT License (MIT)
#
# Copyright (c) 2014-2017, Erik Moqvist
#
# Permission is hereby granted, free of charge, to any person
# obtaining a copy of this software and associated documentation
# files (the "Software"), to deal in the Software without
# restriction, including without limitation the rights to use, copy,
# modify, merge, publish, distribute, sublicense, and/or sell copies
# of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be
# included in all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
# NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
# BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
# ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
# CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.
#
# This file is part of the Simba project.
#
##################################################################

nano32.name=Nano32

nano32.upload.tool=esptool
nano32.upload.speed=115200
nano32.upload.resetmethod=ck
nano32.upload.maximum_size=2000000
nano32.upload.maximum_data_size=294912
nano32.upload.wait_for_upload_port=true
nano32.serial.disableDTR=true
nano32.serial.disableRTS=true

nano32.build.mcu=esp32
nano32.build.f_cpu=240000000L
nano32.build.board=Nano32
nano32.build.variant=nano32
nano32.build.core=Simba:simba
nano32.build.ldscript=simba.flash.ld
nano32.build.flash_size=4M
nano32.build.flash_mode=dio
nano32.build.flash_freq=40

nano32.compiler.c.extra_flags={nano32_compiler_c_extra_flags}
nano32.compiler.cpp.extra_flags={nano32_compiler_cxx_extra_flags}
nano32.compiler.S.extra_flags={nano32_compiler_c_extra_flags}
nano32.compiler.c.elf.extra_flags={nano32_compiler_c_elf_extra_flags}
nano32.compiler.c.elf.libs={nano32_compiler_c_elf_libs}

##################################################################

B52A.name=B52A

B52A.upload.tool=esptool
B52A.upload.speed=115200
B52A.upload.resetmethod=ck
B52A.upload.maximum_size=2000000
B52A.upload.maximum_data_size=294912
B52A.upload.wait_for_upload_port=true
B52A.serial.disableDTR=true
B52A.serial.disableRTS=true

B52A.build.mcu=esp32
B52A.build.f_cpu=240000000L
B52A.build.board=Nano32
B52A.build.variant=nano32
B52A.build.core=Simba:simba
B52A.build.ldscript=simba.flash.ld
B52A.build.flash_size=4M
B52A.build.flash_mode=dio
B52A.build.flash_freq=40

B52A.compiler.c.extra_flags={nano32_compiler_c_extra_flags}
B52A.compiler.cpp.extra_flags={nano32_compiler_cxx_extra_flags}
B52A.compiler.S.extra_flags={nano32_compiler_c_extra_flags}
B52A.compiler.c.elf.extra_flags={nano32_compiler_c_elf_extra_flags}
B52A.compiler.c.elf.libs={nano32_compiler_c_elf_libs}

##################################################################

B52B.name=B52B

B52B.upload.tool=esptool
B52B.upload.speed=115200
B52B.upload.resetmethod=ck
B52B.upload.maximum_size=2000000
B52B.upload.maximum_data_size=294912
B52B.upload.wait_for_upload_port=true
B52B.serial.disableDTR=true
B52B.serial.disableRTS=true

B52B.build.mcu=esp32
B52B.build.f_cpu=240000000L
B52B.build.board=Nano32
B52B.build.variant=nano32
B52B.build.core=Simba:simba
B52B.build.ldscript=simba.flash.ld
B52B.build.flash_size=4M
B52B.build.flash_mode=dio
B52B.build.flash_freq=40

B52B.compiler.c.extra_flags={nano32_compiler_c_extra_flags}
B52B.compiler.cpp.extra_flags={nano32_compiler_cxx_extra_flags}
B52B.compiler.S.extra_flags={nano32_compiler_c_extra_flags}
B52B.compiler.c.elf.extra_flags={nano32_compiler_c_elf_extra_flags}
B52B.compiler.c.elf.libs={nano32_compiler_c_elf_libs}

##################################################################
